app/views/works/_form.html.erb

    <%= f.label :category %>
    <%= f.select :category, Work.categories.map {|w| [w, w]} %>
---
SELECT "works".* FROM "works"