app/views/works/_top.html.erb

SELECT COUNT(*) FROM "votes" WHERE "votes"."work_id" = $1  [["work_id", 30]]
---
        </h4>
        <p><%= work.votes.count %> votes</p>