app/views/works/index.html.erb

SELECT "works".* FROM "works"
---
      </tr>
      <% Work.all.each do |work| %>