app/views/works/index.html.erb

SELECT COUNT(*) FROM "votes" WHERE "votes"."work_id" = $1  [["work_id", 6]]
---
          <tr>
            <td> <%= work.votes.size %></td>

SELECT COUNT(*) FROM "votes" WHERE "votes"."work_id" = $1  [["work_id", 39]]
---
          <tr>
            <td><%= work.votes.count %></td>

SELECT COUNT(*) FROM "votes" WHERE "votes"."work_id" = $1  [["work_id", 39]]
---
            <tr>
              <td><%= work.votes.count %></td>