app/views/works/main.html.erb

SELECT COUNT(*) FROM "votes" WHERE "votes"."work_id" = $1  [["work_id", 30]]
---
        <section class = "creator"> by <%= work.creator%> </section>
        <section class = "votes"> <%= work.votes.count %> votes </section>