app/views/works/show.html.erb

<section class="works-votes__container">
  <h3 class="works-votes__header"> <%@work.votes.count %>
---
SELECT "votes".* FROM "votes" WHERE "votes"."work_id" = $1  [["work_id", 30]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."work_id" = $1  [["work_id", 4]]

<tbody>
<% @work.votes.each do |vote| %>
---
SELECT "votes".* FROM "votes" WHERE "votes"."work_id" = $1  [["work_id", 4]]