app/views/works/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    <section class="voting-sect" id="show-works-voting">
      <% current_user = User.find_by(id: session[:user_id])%>