app/views/users/index.html.erb

          <td><%= link_to user.name, user_path(user.id) %></td>
          <td><%= user.votes.count %></td>
---
SELECT COUNT(*) FROM "votes" WHERE "votes"."user_id" = $1  [["user_id", 1]]