app/views/users/show.html.erb

SELECT "votes".* FROM "votes" WHERE "votes"."user_id" = $1  [["user_id", 1]]
SELECT  "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    <thead>
      <% @user.votes.each do |vote| %>
        <tr>
          <td><%=link_to Work.find_by(id: vote.work_id).name, work_path(vote.work.id) %></td>