app/views/users/show.html.erb

SELECT "votes".* FROM "votes" WHERE "votes"."user_id" = $1  [["user_id", 1]]
---
      <tbody>
        <% @user.votes.each do |vote| %>