app/controllers/homepages_controller.rb

SELECT  "works".* FROM "works" LIMIT $1  [["LIMIT", 11]]
---
  def index
    @spotlight = Work.spotlight.first