app/controllers/homepages_controller.rb

  def index
    @books = Work.where(category: "book").order(votes_count: :desc).limit(10)
    @albums = Work.where(category: "album").order(votes_count: :desc).limit(10)
    @movies = Work.where(category: "movie").order(votes_count: :desc).limit(10)
    @spotlight = Work.order(votes_count: :desc).first
---
SELECT  "works".* FROM "works" WHERE "works"."category" = $1 ORDER BY "works"."votes_count" DESC LIMIT $2  [["category", "album"], ["LIMIT", 10]]
SELECT  "works".* FROM "works" ORDER BY "works"."votes_count" DESC LIMIT $1  [["LIMIT", 1]]