app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT  "users".* FROM "users" LIMIT $1  [["LIMIT", 1]]

  def show
    user_id = params[:id]
    @user = User.find_by(id: user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def login
    username = (params[:user][:username])
    user = User.find_by(username: username)

    if user
      session[:user_id] = user.id
      flash[:success] = "Successfully logged in as returning user #{username}"
      redirect_to root_path
    else
      user = User.create(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "jo"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "er"], ["created_at", "2019-10-17 02:04:38.996242"], ["updated_at", "2019-10-17 02:04:38.996242"]]

  def current
    @current_user = User.find_by(id: session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]