app/controllers/votes_controller.rb

INSERT INTO "votes" ("created_at", "updated_at", "user_id", "work_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2019-10-17 01:04:04.660092"], ["updated_at", "2019-10-17 01:04:04.660092"], ["user_id", 1], ["work_id", 4]]
---
  def create
    current_user = User.find_by(id: session[:user_id])
    work_id = params[:work_id]

    if current_user.nil?
      flash[:warning] = "You must be signed in"
      redirect_to login_path
      return
    end

    vote = Vote.new(user_id: current_user.id, work_id: work_id)
    if vote.save