app/controllers/votes_controller.rb

SELECT  "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    work = Work.find_by(id: params[:work_id])
    user = User.find_by(id: session[:user_id])