app/controllers/votes_controller.rb

INSERT INTO "votes" ("created_at", "updated_at", "user_id", "work_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2019-10-17 01:04:04.660092"], ["updated_at", "2019-10-17 01:04:04.660092"], ["user_id", 1], ["work_id", 4]]
UPDATE "works" SET "votes_count" = COALESCE("votes_count", 0) + 1 WHERE "works"."id" = $1  [["id", 4]]
---
  def upvote
    user_id = session[:user_id]
    if user_id
      work_id = params["work_id"]

      @vote = Vote.new(work_id: work_id, user_id: user_id, vote_type: "upvote")
      work = Work.find_by(id: work_id)
      work.vote_count += 1

      if @vote.save && work.save