app/controllers/works_controller.rb

  def index
    @albums = Work.where(category: "album").sort
---
SELECT  "works".* FROM "works" WHERE "works"."category" = $1 ORDER BY "works"."id" ASC LIMIT $2  [["category", "album"], ["LIMIT", 1]]

  def show
    @work = Work.find_by(id: params[:id])
---
SELECT  "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    work = Work.new(work_params)

    if work.save
---
INSERT INTO "works" ("title", "creator", "description", "category", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Dirty Computer"], ["creator", ""], ["description", ""], ["category", "album"], ["created_at", "2019-10-16 19:29:23.933849"], ["updated_at", "2019-10-16 19:29:23.933849"]]

  def destroy
    work = Work.find_by(id: params[:id])
    if work.destroy
---
SELECT  "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
DELETE FROM "works" WHERE "works"."id" = $1  [["id", 28]]

  def edit
    @work = Work.find_by(id: params[:id])
---
SELECT  "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]

  def update
    work = Work.find_by(id: params[:id])

    if work.update(work_params)
---
SELECT  "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
UPDATE "works" SET "creator" = $1, "updated_at" = $2 WHERE "works"."id" = $3  [["creator", "Janelle Monae"], ["updated_at", "2019-10-16 19:34:21.610323"], ["id", 29]]

  def upvote
    work = Work.find_by(id: params[:id])
    user = User.find_by(id: session[:user_id])

    if user.nil?
      flash[:errors] = { user: ["must be logged in to upvote"] }
      flash[:action] = "upvote"
      redirect_to work_path(work.id)
    elsif user.voted? work
      flash[:errors] = { user: ["already upvoted #{ work.title }"] }
      flash[:action] = "upvote"
      redirect_to work_path(work.id)
    else
      Vote.create(work: work, user: user)
---
SELECT  "works".* FROM "works" WHERE "works"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "work_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2019-10-16 23:06:45.925879"], ["updated_at", "2019-10-16 23:06:45.925879"], ["user_id", 3], ["work_id", 30]]