app/controllers/works_controller.rb

  def index
    @works = Work.all
---
SELECT  "works".* FROM "works" ORDER BY "works"."id" DESC LIMIT $1  [["LIMIT", 1]]

  def update
    if @work.update(work_params)
---
UPDATE "works" SET "creator" = $1, "updated_at" = $2 WHERE "works"."id" = $3  [["creator", "Janelle Monae"], ["updated_at", "2019-10-15 23:34:09.307467"], ["id", 27]]

  def destroy
    @work.destroy
---
DELETE FROM "works" WHERE "works"."id" = $1  [["id", 1]]