app/models/work.rb

SELECT  "works".* FROM "works" ORDER BY "works"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def self.spotlight
    self.all.min

SELECT  "works".* FROM "works" WHERE "works"."category" = $1 LIMIT $2  [["category", "movie"], ["LIMIT", 10]]
---
  def self.top_ten category
    self.where(category: category).sort.take(10)

SELECT COUNT(*) FROM "votes" WHERE "votes"."work_id" = $1  [["work_id", 3]]
---
  def <=>(other)
    case votes.count <=> other.votes.count