app/views/layouts/application.html.erb

      <%if session[:user_id]%>
        <% user = User.find_by(id: session[:user_id]) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]